app/views/posts/_form.html.erb

      <%= f.label :tag_ids, label: 'Tags para o post:' %> <button class="btn btn-primary" id="menu-toggle">Criar tag</button><br>
      <%= f.collection_check_boxes :tag_ids, Tag.all, :id, :name, include_hidden: false do |box| %>
---
SELECT "tags".* FROM "tags"