app/views/posts/show.html.erb


  <% if @post.tags.any? %>
    <dt>Tags:</dt>
    <% @post.tags.each do |tags| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "posts_tags" ON "tags"."id" = "posts_tags"."tag_id" WHERE "posts_tags"."post_id" = ?  [["post_id", 1]]
SELECT  1 AS one FROM "tags" INNER JOIN "posts_tags" ON "tags"."id" = "posts_tags"."tag_id" WHERE "posts_tags"."post_id" = ? LIMIT ?  [["post_id", 4], ["LIMIT", 1]]