app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @tag = Tag.new

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Teste de Post 2"], ["content", "Isso é um teste de post"], ["created_at", "2020-12-15 18:59:02.478231"], ["updated_at", "2020-12-15 18:59:02.478231"]]