app/controllers/tags_controller.rb

  def create
    @tag = Tag.new(tag_params)
    if @tag.save
---
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "agT"], ["created_at", "2020-12-16 17:14:16.154394"], ["updated_at", "2020-12-16 17:14:16.154394"]]

  def destroy
    @tag.destroy
---
DELETE FROM "tags" WHERE "tags"."id" = ?  [["id", 1]]

    def set_tag
      @tag = Tag.find(params[:id])
---
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]